/**
 * 변수
 * 
 * //a 라는 이름의 변수를 선언 var a=10;
 * //a변수에 저장되어 있는 값을 사용.
 * 
 * 
 * 배열
 * 
 * // a라는 이름의 배열을 선언 
 * var a = [10,20,30]
 * ex) a[0], a[1], a[2]
 * 
 * 
 * 함수(function)
 * 
 *function add(a,b){ 
 *   alert(a + b);
 *  return;
 * }
 * add(9,5) = 14
 * 
 * 선언
 * 
 * function 함수명(매개변수){
 *   함수를 이용하여 실행하고자하는 코드
 * }
 * 
 * 호출 
 * 함수명()
 */

///////////////////////////////////////

// 함수 선언 (더하기를 하기 위한 함수)


/**

가로3 세로 4 일때 삼각형의 넓이를 구하는 함수를 작성하시오 (선언문, 호출 둘다)

function triangle (a,b){
return 1/2 * a * b;
}

alert(triangle(3,4))

*/